[
  {
    "level": 0,
    "ritualCasting": false,
    "range": "60 feet",
    "description": "You hurl a bubble of acid. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a Dexterity saving throw or take 1d6 damage.<br>&emsp; This spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).",
    "concentration": false,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "Instantaneous",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Conjuration",
    "name": "Acid Spalsh",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 1,
    "ritualCasting": false,
    "range": "Self",
    "description": "Your prayer empowers you with divine radiance. Until the spell ends, your weapon attacks deal an extra 1d4 radiant damage on hit.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 minute",
    "castingTime": "1 bonus action",
    "verbalComponent": true,
    "school": "Evocation",
    "name": "Divine Favor",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 2,
    "ritualCasting": false,
    "range": "Touch",
    "description": "You touch a willing creature to grant it the ability to see in the dark. For the duration, that creature has darkvision out to a range of 60 feet.",
    "concentration": false,
    "materialComponents": "either a pinch of dried carrot or an agate",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "8 hours",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Transmutation",
    "name": "Darkvision",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 1,
    "ritualCasting": false,
    "range": "Touch",
    "description": "A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs.<br>&emsp;<b><i>At Higher Levels. <\/b><\/i> When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st.",
    "concentration": false,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "Instantaneous",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Evocation",
    "name": "Cure Wounds",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 2,
    "ritualCasting": false,
    "range": "30 feet",
    "description": "Your spell bolsters your allies with toughness and resolve. Choose up to three creature within range. Each creature's hit point maximum and current hit points increase by 5 for the duration.<br>&emsp;<b><i>At Higher Levels.<\/i><\/b> When you cast this spell using a spell slot of 3rd level or higher, a target's hit points increase by an additional 5 for each slot level above 2nd.",
    "concentration": false,
    "materialComponents": "a tiny strip of white cloth",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "8 hours",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Aid",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 1,
    "ritualCasting": true,
    "range": "30 feet",
    "description": "You set an alarm against unwanted intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot cube. Until the spell ends, an alarm alerts you whenever a Tiny or larger creature touches or enters the warded area. When you cast the spell, you can designate creatures that won't set off the alarm. You also choose whether the alarm is mental or audible.<br>&emsp; A mental alarm alerts you with a ping in your mind if you are within 1 mile of the warded area. This ping awakens you if you are sleeping.<br>&emsp;An audible alarm produces the sound of a hand bell for 10 seconds within 60 feet.",
    "concentration": false,
    "materialComponents": "a tiny bell and a piece of fine silver wire",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "8 hours",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Alarm",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 2,
    "ritualCasting": false,
    "range": "Self",
    "description": "You assume a different form. When you cast the spell, choose one of the following options, the effects of which last for the duration of the spell. While the spell lasts, you can end one option as an action to gain the benefits of a different one. <br>&emsp;<b><i>Aquatic Adaptation.<\/i><\/b> You adapt your body to an aquatic environment, sprouting gills and growing webbing between you fingers. You can breathe underwater and gain a swimming speed equal to your walking speed.<br>&emsp;<b><i>Change Appearance.<\/i><\/b> You transform your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair length, coloration, and distinguishing characteristics, if any. You can make yourself appear as a member of another race, though none of your statistics change. You also can't appear as a creature of a different size than you, and your basic shape stays the same; if you're bipedal, you can't use this spell to become quadrupedal, for instance. At any time for the duration of the spell, you can use your action to change your appearance in this way again.<br>&emsp;<b><i>Natural Weapons. <\/i><\/b>You grow claws, fangs, spines, or a different natural weapon of your choice. Your unarmed strikes deal 1d6 bludgeoning, piercing, or slashing damage, as appropriate to the natural weapon you choose, and you are proficient with your unarmed strikes. Finally, the natural weapon is magic and you have a +1 bonus to the attack and damage rolls you make using it.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 hour",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Transmutation",
    "name": "Alter Self",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 1,
    "ritualCasting": false,
    "range": "30 feet",
    "description": "This spell lets you convice a beast that you mean it no harm. Choose a beast that you can see within range. It must see and hear you. If the beast's Intelligence is 4 or higher, the spell fails. Otherwise, the beast must succeed on a Wisdom saving throw or be charmed by you for the spell's duration. If you or one of your companions harms the target, the spell ends.<br>&emsp;<b><i>At Higher Levels. <\/i><\/b>When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional beast for each slot level above 1st. ",
    "concentration": false,
    "materialComponents": "a morsel of food",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "24 hours",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Enchantment",
    "name": "Animal Friendship",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 2,
    "ritualCasting": true,
    "range": "30 Feet",
    "description": "By means of this spell, you use an animal to deliver a message. Choose a Tiny beast you can see within range, such as a squirrel, a blue jay, or a bat. You specify a location, which you must have visited, and a recipient who matches a general description, such as \"a man or woman dressed in the uniform of the town guard\" or \"a red-haired dwarf wearing a pointed hat.\" You also speak a message of up to twenty-five words. The target beast travels for the duration of the spell toward the specified location, coivering about 50 miles per 24 hours for a flying messenger, or 25 miles for other animals.<br>&emsp;When the messenger arrives, it delivers your message to the creature that you described, replicating the sound of your voice. The messenger speaks only to a creature matching the description you gave. If the messenger doesn't reach its destination before the spell ends, the message is lost, and the beast makes its way back to where you cast this spell.<br>&emsp;<b><i>At Higher Levels.<\/i><\/b> If you cast this spell using a spell slot of 3rd level or higher, the duration of the spell increases by 48 hours for each slot level above 2nd. ",
    "concentration": false,
    "materialComponents": "a morsel of food",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "24 hours",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Enchantment",
    "name": "Animal Messenger",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 8,
    "ritualCasting": false,
    "range": "30 feet",
    "description": "Your magic turns others into beasts. Choose any number of willing creature you can see within range. You transform each target into the form of a Large or smaller beast with challenge rating of 4 or lower. On subsequent turns, you can use your action to transform affected creature into new forms.<br>&emsp;The transformation lasts for the duration for each target, or until the target drops to 0 hit points, or dies. You can choose a different form for each target. A target's game statistics are replaced by the statistics of the chosen beast, though the target retains its alignment and Intelligence, Wisdom, and Charisma scores. The target assumes the hit points of its new form, and when it reverts to its normal form, it returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious. The creature is limited in the actions it can perform by the nature of its new form, and it can't speak or cast spells.<br>&emsp;The target's gear melds into the new form. The target can't activate, wear, or otherwise benefit from any of its equipment.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "24 hours",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Transmutation",
    "name": "Animal Shapes",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 3,
    "ritualCasting": false,
    "range": "10 feet",
    "description": "This spell creates an undead servant. Choose a pile of bones or a corpse of a Medium or smaller humanoid within range. Your spell imbues the target with a foul mimicry of life, raising it as an undead creature. The target becomes a skeleton if you chose bones or a zombie if you chose a corpse (the DM has the creature's game statistics).<br>&emsp;On each of your turns, you can use a bonus action to mentally command any creature you made with this spell if the creature is within 60 feet of you (if you control multiple creatures, you can command any or all of them at the same time, issuing the same command to each one). You decide what action the creature will take and where it will move during its next turn, or you can issue a general command, such as to guard a particular chamber or corridor. If you issue no commands, the creature only defends itself against hostile creatures. Once given an order, the creature continues to follow it until its task is complete.<br>&emsp;The creature is under your control for 24 hours, after which it stops obeying any command you've given it. To maintain control for another 24 hours, you must cast this spell on the creature again before the current 24-hour period ends. This use of the spell reasserts your control over up to four creatures you have animated with this spell, rather than animating a new one.<br>&emsp;<b><i>At Higher Levels.<\/i><\/b> When you cast this spell using a spell slot of 4th level or higher, you animate or reassert control over two additional undead creatures for each slot level above 3rd. Each of the creatures must come from a different corpse or pile of bones. ",
    "concentration": false,
    "materialComponents": "a drop of blood, a piece of flesh, and pinch of bone dust",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "Instantaneous",
    "castingTime": "1 minute",
    "verbalComponent": true,
    "school": "Necromancy",
    "name": "Animate Dead",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 5,
    "ritualCasting": false,
    "range": "120 feet",
    "description": "Objects come to life at your command. Choose up to ten nonmagical objects within range\r\nthat are not being worn or carried. Medium targets count as two objects, Large targets\r\ncount as four objects, Huge targets count as eight objects. You can't animate any \r\nobject larger than Huge. Each target animates and becomes a creature under your control\r\nuntil the spell ends or until reduced to 0 hit points.<br>&emsp;As a bonus action, you\r\ncan mentally command any creature you made with this spell if the creature is within \r\n500 feet of you (if you control multiple creatures, you can command any or all of them\r\nat the same time, issuing the same command to each one). You decide what action the creature \r\nwill take and where it will move during its next turn, or you can issue a general command,\r\nsuch as to guard a particular chamber or corridor. If you issue no commands, the creature\r\nonly defends itself against hostile creatures. Once given an order, the creature\r\ncontinues to follow it until its task is complete.<br><br><b>Animated Object Statistics<\/b><br>\r\n<table>\r\n<tr>\r\n\t<b><th>Size<\/th><th>HP<\/th><th>AC<\/th><th>Attack<\/th><th>Dex<\/th><th>Dex<\/th><\/b>\r\n<\/tr>\r\n<tr>\r\n\t<th>Tiny<\/th><th>20<\/th><th>18<\/th><th>+8 to hit, 1d4 + 4 damage<\/th><th>4<\/th><th>18<\/th>\r\n<\/tr>\r\n<tr>\r\n\t<th>Small<\/th><th>25<\/th><th>16<\/th><th>+6 to hit, 1d8 + 2 damage<\/th><th>6<\/th><th>14<\/th>\r\n<\/tr>\r\n<tr>\r\n\t<th>Medium<\/th><th>40<\/th><th>13<\/th><th>+5 to hit, 2d6 + 1 damage<\/th><th>10<\/th><th>12<\/th>\r\n<\/tr>\r\n<tr>\r\n\t<th>Large<\/th><th>50<\/th><th>10<\/th><th>+6 to hit, 2d10 + 1 damage<\/th><th>14<\/th><th>10<\/th>\r\n<\/tr>\r\n<tr>\r\n\t<th>Huge<\/th><th>80<\/th><th>10<\/th><th>+8 to hit, 2d12 + 4 damage<\/th><th>18<\/th><th>6<\/th>\r\n<\/tr>\r\n<\/table>\r\n<br>&emsp;An animated object is a construct with AC, hit points, attacks, Strength, and Dexterity\r\ndetermined by its size. Its Constitution is 10 and its Intelligence and Wisdom are 3, and its Charisma\r\nis 1. Its speed is 30 feet; if the object lacks legs or other appendages it can use for locomotion,\r\nit instead has a flying speed of 30 feet and can hover. If the object is securly attached\r\nto a surface or a larger object, such as a chain bolted to a wall, its speed is 0. It has blindsight\r\nwith radius a radius of 30 feet and is blind beyond that distance. When the animated object\r\ndrops to 0 hit points, it reverts to its original object form, and any remaining damage carries\r\nover to its original object form.<br>&emsp;If you command an object to attack, it can make a single\r\nmelee attack against a creature within 5 feet of it. It makes a slam attack with an attack bonus and\r\nbludgeoning damage determined by its size. The DM might rule that a specific object inflicts \r\nslashing or piercing damage based on its form.\r\n<br>&emsp;<b><i>At Higher Levels.<\/b><\/i> If you cast this spell using a spell slot of 6th level or higher,\r\nyou can animate two additional objects for each slot level above 5th.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 minute",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Transmutation",
    "name": "Animate Objects",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 5,
    "ritualCasting": false,
    "range": "Self (10-foot radius)",
    "description": "A shimmering barrier extends out from you in a 10-foot radius and moves with you, remaining centered on you and hedging out creatures other than undead and constructs. The barrier lasts for the duration.<br>&emsp;The barrier prevents an affected creature from passing or reaching through. An affected creature can cast spells or make attacks or make attacks with ranged or reach weapons through the barrier.<br>&emsp;If you move so that an affected creature is forced to pass through the barrier, the spell ends.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 hour",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Antilife Shell",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 8,
    "ritualCasting": false,
    "range": "Self (10-foot radius)",
    "description": "A 10-foot-radius invisible sphere of antimagic surrounds you. This area is divorced from the magical energy that suffuses the multiverse. Within the sphere, spells can't be case, summoned creatures disappear, and even magic items become mundane. Until the spell ends, the sphere moves with you, centered on you.<br>&emsp;Spells and other magical effects, except those created by an artifact or deity, are suppressed in the sphere and can't protrude into it. A slot expended to cast a suppressed spell is consumed. While an effect is suppressed, it doesn't function, but the time it spends suppressed counts against its duration.<br>&emsp;<b><i>Targeted Effects.<\/i><\/b> Spells and other magical effects, such as <i>magic missile<\/i> and <i>charm person<\/i>, that target a creature or an object in the sphere have no effect on the target.<br>&emsp;<b><i>Areas of Magic.<\/i><\/b> The area of another spell or magical effect, such as <i>fireball<\/i>, can't extend into the sphere. If the sphere overlaps an area of magic, the part of the area that is covered by the sphere is suppressed. For example, the flames created by a <i>wall of fire<\/i> are suppressed within the sphere, creating a gap in the wall if the overlap is large enough.<br>&emsp;<b><i>Spells.<\/i><\/b> Any active spell or other magical effect on a creature or an object in the sphere is suppressed while the creature or object is in it.<br>&emsp;<b><i>Magic Items.<\/i><\/b> The properties and powers of magic items are suppressed in the sphere. For example, a <i>+1 longsword<i> in the sphere functions as a nonmagical longsword.<br>&emsp; A magic weapon's properties and powers are suppressed if it is used against a target in the sphere or wielded by an attacker inside the sphere. If a magic weapon or a piece of magic ammunition fully leaves the sphere (for example, if you fire a magic arrow or throw a magic sphere at a target outside the sphere), the magic of the sphere ceases to be suppressed as soon as it exits.<br>&emsp;<b><i>Magical Travel. <\/i><\/b> Teleportation and planar travel fail to work in the sphere, whether the sphere is the destination or the departure point for such magical travel. A portal to another location, world, or plane of existence, as well as an opening to an extradimensional space such as that created by the <i>rope trick<\/i> spell, temporarily closes while in the sphere.<br>&emsp;<b><i>Creatures and Objects. <\/i><\/b> A creature or object summoned or created by magic temporarily winks out of existence in the sphere. Such a creature instantly reappears once the space the creature occupied is no longer within the sphere.<br>&emsp;<b><i>Dispel Magic.<\/i><\/b> Spells and magical effects such as <i>dispel magic<\/i> have no effect on the sphere. Likewise, the spheres created by different <i>antimagic field<\/i> don't nullify each other.",
    "concentration": true,
    "materialComponents": "a pinch of powdered iron or iron filings",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 hour",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Antimagic Field",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 8,
    "ritualCasting": false,
    "range": "60 feet",
    "description": "This spell attracts or repels creatures of your choice. You target something within range, either a Huge or smaller object or creature or an area that is no larger than a 200-foot cube. Then specify a kind of intelligent creature, such as red dragons, goblins, or vampires. you invest the target with an aura that either attracts or repels the specified creatures for the duration. Choose antipathy or sympathy as the aura's effect.<br>&emsp;<b><i>Antipathy.<\/i><\/b> The enchantment causes creatures of the kind you designated to feel and intense urge to leave the area and avoid the target. When such a creature can see the target or comes within 60 feet of it, the creature must succeed on a Wisdom saving throw or become frightened. The creature remains frightened while it can see the target or is within 60 feet of it. While frightened by the target, the creature must use its movement to move to the nearest safe spot from which it can't see the target. If the creature moves more than 60 feet from the target and can't see it, the creature is no longer frightened, but the creature becomes frightened again if it regains sight of the target or moves within 60 feet of it.<br>&emsp;<b><i>Sympathy.<\/i><\/b> The enchantment causes the specified creatures tot feel an intense urge to approach the target while within 60 feet of it or able to see it. When such a creature can see the target or comes within 60 fee of it, the creature must succeed on a Wisdom saving throw or use its movement on each of its turns to enter the area or move within reach of the target. When the creature has done so, it can't willingly move away from the target.<br>&emsp;If the target damages or otherwise harms an affected creature, the affected creature can make a Wisdom saving throw to end the effect, as described below.<br>&emsp;<b><i>Ending the Effect.<\/i><\/b> If an affected creature ends its turn while not within 60 feet of the target or able to see it, the creature makes a Wisdom saving throw. On a successful save, the creature is no longer affected by the target and recognizes the feeling of repugnance or attraction as magical. In addition, a creature affected by the spell is allowed another Wisdom saving throw every 24 hours while the spell persists.<br>&emsp;A creature that successfully saves against this effect is immune to it for 1 minute, after which time it can be affected again.",
    "concentration": false,
    "materialComponents": "either a lump of alum soaked in vinegar for antipathy effect or a drop of honey for the sympathy effect",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "10 days",
    "castingTime": "1 hour",
    "verbalComponent": true,
    "school": "Enchantment",
    "name": "Antipathy\/Sympathy",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 4,
    "ritualCasting": false,
    "range": "30 feet",
    "description": "You create and invisible, magical eye within range that hovers in the air for the duration.<br>&emsp;You mentally receive visual information from the eye, which has normal vision and darkvision out to 30 feet. The eye can look in every direction.<br>&emsp;As an action, you can move the eye up to 30 feet in any direction. There is no limit to how far away from you the eye can move, but it can't enter another plane of existence. A solid barrier blocks the eye's movement, but the eye can pass through an opening as small as 1 inch in diameter.",
    "concentration": true,
    "materialComponents": "a bit of bat fur",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 hour",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Divination",
    "name": "Arcane Eye",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 6,
    "ritualCasting": false,
    "range": "500 feet",
    "description": "You create linked teleportation portals that remain open for the duration. Choose two points on the ground that you can see, one point within 10 feet of you and one point within 500 feet of you. A circular portal, 10 feet in diameter, opens over each point. If the portal would open in the space occupied by a creature, the spell fails, and the casting is lost.<br>&emsp;The portals are two-dimensional glowing rings filled with mist, hovering inches from the ground and perpendicular to it at the points you choose. A ring is visible only from one side (your choice), which is the side that functions as a portal.<br>&emsp;Any creature or object entering the portal exits from the other portal as if the two were adjacent to each other; passing through a portal from the nonportal side has no effect. The mist that fills each portal is opaque and blocks vision through it. On your turn, you can rotate the rings as a bonus action so that the active side faces in a different direction. ",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "10 minutes",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Conjuration",
    "name": "Arcane Gate",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 2,
    "ritualCasting": false,
    "range": "Touch",
    "description": "You touch a closed door, window, gate, chest, or other entryway, and it becomes locked for the duration. You and the creatures you designate when you cast this spell can open the object normally. You can also set a password that, when spoken within 5 feet of the object, suppress the spell for 1 minute. Otherwise, it is impassable until it is broken or the spell is dispelled or suppressed. Casting <i>knock<\/i> on the object suppresses <i>arcane lock<\/i> for 10 minutes.<br>&emsp;While affected by this spell, the object is more difficult to break or force open; the DC to break it or pick any locks on it increases by 10.",
    "concentration": false,
    "materialComponents": "gold dust worth at least 25 gp, which the spell consumes",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "Until dispelled",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Arcane Lock",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 1,
    "ritualCasting": false,
    "range": "Self",
    "description": "A protective magical force surrounds you, manifesting as a spectral frost that covers you and your gear. You gain 5 temporary hit points for the duration. If a creature hits you with a melee attack while you have these hit points, the creature takes 5 cold damage.<br>&emsp;<b><i>At Higher Levels. <\/i><\/b>When you cast this spell using a spell slot of 2nd level or higher, both the temporary hit points and the cold damage increase by 5 for each slot level above 1st.",
    "concentration": false,
    "materialComponents": "a cup of water",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 hour",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Armor of Agathys",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 1,
    "ritualCasting": false,
    "range": "Self (10-foot radius)",
    "description": "You invoke the power of Hadar, the Dark Hunger. Tendrils of dark energy erupt from you and batter all creatures within 10 feet of you. Each creature in that area must make a Strength saving throw. On a failed save, a target takes 2d6 necrotic damage and can't take reactions until its next turn. On a successful save, the creature takes half damage, but suffers no other effect.<br>&emsp;<b><i>At Higher Levels. <\/i><\/b> When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st. ",
    "concentration": false,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "Instantaneous",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Conjuration",
    "name": "Arms of Hadar",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 9,
    "ritualCasting": false,
    "range": "10 feet",
    "description": "You and up to eight willing creatures within range project your astral bodies into the Astral Plane (the spell fails and the casting is wasted if you are already on that plane). The material body you leave behind is unconscious and in a state of suspended animation; it doesn't need food or air  and doesn't age.<br>&emsp;Your astral body resembles your mortal form in almost every way, replication your game statistics and possessions. The principal difference is the addition of a silvery cord that extends from between you shoulder blades and trails behind you, fading to invisibility after 1 foot. This cord is your tether to the material body. As long as the tether remains intact, you can find your way home. If the cord is cut-something that can happen only when an effect specifically stats that it does-your soul and body are separated, killing you instantly.<br>&emsp;Your astral form can freely travel through the Astral Plane and can pass through portals there leading to any other plane. If you enter a new plane or return to the plane you were on when casting this spell, your body and possessions are transported along the silver cord, allowing you to re-enter your body as you enter the new plane. Your astral form is a separate incarnation. Any damage or other effects that apply to it have no effect on your physical body, nor do they persist when you return to it.<br>&emsp;The spell ends for you and your companions when you use your action to dismiss it. When the spell ends, the affected creature returns to its physical body, and it awakens.<br>&emsp;The spell might also end early for you or on of your companions. A successful <i>dispel magic<\/i> spell used against an astral or physical body ends the spell for that creature. If a creature's original body or astral form drops to 0 hit points, the spell ends for that creature. If the spell ends and the silver cord is intact, the cord pulls the creature's astral form back to its body, ending its state of suspended animation.<br>&emsp;If you are returned to your body prematurely, your companions remain in their astral form and must fined their own way back to their bodies, usually by dropping to 0 hit points.",
    "concentration": false,
    "materialComponents": "for each creature you affect with this spell, you must provide one jacinth worth at least 1,000 gp and one ornately carved bar of silver worth at least 100 gp, all of which the spell consumes",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "Instantaneous",
    "castingTime": "1 hour",
    "verbalComponent": true,
    "school": "Necromancy",
    "name": "Astral Projection",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 2,
    "ritualCasting": true,
    "range": "Self",
    "description": "By casting gem-inlaid sticks. rolling dragon bones, laying out ornate cards, or employing some other divining tool, you receive an omen from an otherworldly entity about the results of a specific course of action that you plan to take within the next 30 minutes. The DM chooses from the following possible omens:<br>\r\n<ul>\r\n<li><i>Weal<\/i>, for good results<\/li>\r\n<li><i>Woe<\/i>, for bad results<\/li>\r\n<li><i>Weal and woe<\/i>, for good and bad results<\/li>\r\n<li><i>Nothing<\/i>, for results that aren't particularly good or bad.<\/li>\r\n<\/ul>\r\nThe spell doesn't take into account any possible circumstances that might change the outcome, such as the casting of additional spells or the loss or gain of a companion.<br>&emsp;If you cast the spell two or more times before completing your next long rest, there is a cumulative 25 percent chance for each casting after the first that you get a random reading. The DM makes this roll in secret.",
    "concentration": false,
    "materialComponents": "specially marked sticks, bones, or similar tokens worth at least 25 gp",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "Instantaneous",
    "castingTime": "1 minute",
    "verbalComponent": true,
    "school": "Divination",
    "name": "Augury",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 4,
    "ritualCasting": false,
    "range": "Self (30-foot radius)",
    "description": "Purifying energy radiates from you in a aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each nonhostile creature in the aura (including you) can't become diseased, has resistance to poison damage, and has advantage of saving throws against effects that cause any of the following conditions: blinded, charmed, deafened, frightened, paralyzed, poisoned, and stunned.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": false,
    "duration": "10 minutes",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Aura of Purity",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 4,
    "ritualCasting": false,
    "range": "Self (30-foot radius)",
    "description": "Life-preserving energy radiates from you in a aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. Each nonhostile creature in the aura (including you) has resistance to necrotic damage, and its hit point maximum can't be reduced. In addition, a nonhostile, living creature regains 1 hit point when it starts its turn in the aura with 0 hit points. ",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": false,
    "duration": "10 minutes",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Aura of Life",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 3,
    "ritualCasting": false,
    "range": "Self (30-foot radius)",
    "description": "Healing energy radiates from you in an aura with a 30-foot radius. Until the spell ends, the aura moves with you, centered on you. You can use a bonus action to cause one creature in the aura (including you) to regain 2d6 hit points.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": false,
    "duration": "1 minute",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Evocation",
    "name": "Aura of Vitality",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 5,
    "ritualCasting": false,
    "range": "Touch",
    "description": "After spending the casting time tracing magical pathways within a precious gemstone, you touch a Huge or smaller beast of plant. The target must have either no Intelligence or an Intelligence score of 3 or less. The target gains an Intelligence of 10. The target also gains the ability to speak one language you know. If the target is a plant, it gains the ability to move its limbs, roots, vines, creepers, and so forth, and it gains senses similar to a human's. Your DM choose statistics appropriate for the awakened plant, such as the statistics for the awakened shrub or the awakened tree.<br>&emsp;The awakened beast or plant is charmed by you for 30 days or until you or your companions do anything harmful to it. When the charmed condition ends, the awakened creature chooses whether to remain friendly to you, based on how you treated it while it was charmed. ",
    "concentration": false,
    "materialComponents": "an agate worth at least 1,000 gp, which the spell consumes",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "Instantaneous",
    "castingTime": "8 hours",
    "verbalComponent": true,
    "school": "Transmutation",
    "name": "Awaken",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 1,
    "ritualCasting": false,
    "range": "30 feet",
    "description": "Up to three creature of your choice that you see within range must make a Charisma saving throws. Whenever a target that fails this saving throw makes an attack roll or saving throw before the spell ends, the target must roll a d4 and subtract the number rolled from the attack roll or saving throw.<br>&emsp;<b><i>At Higher Levels.<\/i><\/b> When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st.",
    "concentration": true,
    "materialComponents": "A drop of blood",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 minute",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Enchantment",
    "name": "Bane",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 5,
    "ritualCasting": false,
    "range": "Self",
    "description": "The next time you hit a creature with a weapon attack before this spell ends, your weapon crackles force, and the attack deals an extra 5d10 force damage to the target. Additionally, if this attack reduces the target to 50 hit points or fewer, you banish it. If the target is native to a different plane of existence, than the one you're on, the target disappears, returning to its home plane. If the target is native to the plane you're on, the creature vanishes into a harmless demiplane. While there, the target is incapacitated. It remains there until the spell ends, at which point the target reappears in the space it left or in he nearest unoccupied space if that space is occupied.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": false,
    "duration": "1 minute",
    "castingTime": "1 bonus action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Banishing Smite",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 4,
    "ritualCasting": false,
    "range": "60 feet",
    "description": "You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a Charisma saving throw or be banished.<br>&emsp;If the target is native to the plane of existence you're on, you banish the target to a harmless demiplane. While there, the target is incapacitated. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest space unoccupied space if that space is occupied.<br>&emsp;IF the target is native to a different plane of existence than the one you're on, the target is banished with a faint popping noise, returning to its home plane. If the spell ends before 1 minute has passed, the target reappears in a space it left or in the nearest unoccupied space if that space is occupied. Otherwise, the target doesn't return.<br>&emsp;<b><i>At Higher Levels.<\/i><\/b> When you cast the spell using a spell lot of 5th level or higher, you can target one additional creature for each slot level above 4th.",
    "concentration": true,
    "materialComponents": "an item distasteful to the target",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 minute",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Banishment",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 2,
    "ritualCasting": false,
    "range": "Touch",
    "description": "You touch a willing creature. Until the spell ends, the target's skin has a rough, bark-like appearance, and the target's AC can't be less than 16, regardless of what kind of armor it is wearing.",
    "concentration": true,
    "materialComponents": "a handful of oak bark",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 hour",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Transmutation",
    "name": "Barkskin",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 3,
    "ritualCasting": false,
    "range": "30 feet",
    "description": "This spell bestows hope and vitality. Choose any number of creatures within range. For the duration, each target has advantage on a Wisdom saving throws and death saving throws, and regains the maximum number of hit points possible from any healing.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 minute",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Abjuration",
    "name": "Beacon of Hope",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 2,
    "ritualCasting": true,
    "range": "Touch",
    "description": "You touche a willing beast. For the duration of the spell, you can use your action to see through the beast's eyes and hear what it hears, and continue to do so until you use your action to return to your normal senses. While perceiving through the beast's senses, you gain the benefits of any special senses possessed by that creature, though you are blinded and deafened to your own surroundings.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 hour",
    "castingTime": "1 action",
    "verbalComponent": false,
    "school": "Divination",
    "name": "Beast Sense",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  },
  {
    "level": 3,
    "ritualCasting": false,
    "range": "Touch",
    "description": "You touch a creature, and that creature must succeed on a Wisdom saving throw or becomre curesed for the duration of the spell. When you cast this spell, choose the nature of the curse from the following options:\r\n<ul>\r\n<li>\r\nChoose one ability score. While cursed, the target has disadvantage on ability checks and saving throws made with that ability score.\r\n<\/li>\r\n<li>\r\nWhile cursed, the target has disadvantage on attack rolls against you.\r\n<\/li>\r\n<li>\r\nWhile cursed, the target must make a Wisdom saving throw at the start of each of its turns. If it fails, it wastes its action that turn doing nothing.\r\n<\/li>\r\n<li>\r\nWhile the target is cursed, your attacks and spells deal an extra 1d8 necrotic damage to the target.\r\n<\/li>\r\n<\/ul>\r\nA <i>remove curse<\/i> spell ends this effect. At the DM's option, you may choose an alternative curse effect, but it should be no more powerful than those described above. The DM has final say on such a curse's effect.<br>&emsp;<b><i>At Higher Levels.<\/i><\/b> If you cast this spell using a spell slot of 4th level or higher, the duration is concentration, up to 10 minutes. If you use the spell slot of 5th level or higher, the duration is 8 hours. If you use a spell lost of 7th level or higher, the duration is 24 hours. If you use a 9th level spell slot, the spell lasts until it is dispelled. Using a spell slot of 5th level or higher grants a duration that doesn't require concentration.",
    "concentration": true,
    "materialComponents": "None",
    "source": "Player's Handbook",
    "somaticComponent": true,
    "duration": "1 minute",
    "castingTime": "1 action",
    "verbalComponent": true,
    "school": "Necromancy",
    "name": "Bestow Curse",
    "_class": "org.nerdcore.spellbookmanager.models.Spell"
  }
]