{
  "Acolyte": {
    "Skill Proficiencies": ["Insight", "Religion"],
    "Languages": ["Any", "Any"],
    "Equipment": ["A holy symbol (a gift to you whe you entered the priesthood)",
    "A prayer book or prayer wheel", "5 Sticks of incense", "Vestiments", "Set of common clothes", "Belt pouch with 15 gp"],
    "Extra Features": {
      "Shelter of the Faithful": "Shelter of the Faithful"
    },
    "Characteristics": {
      "Personality Trait": [
        "I idolize a particular hero of my faith, and constantly refer to that person't deeds and example.",
        "I can find common ground between the fiercest enemies, empathizing with them and always working toward peace.",
        "I see omens in every event and action. The gods try to speak to us, we just need to listen.",
        "Nothing can shake my optimistic attitude.",
        "I quote (or misquote) sacred texts and proverbs in almost every situation.",
        "I am tolerant (or intolerant) of other faiths and respect (or condemn) the worship of other gods.",
        "I've enjoyed fine food, drink, and high society among my temple's elite. Rough living grates on me.",
        "I've spent so long in the temple that I have little practical experience dealing with people in the outside world."
      ],
      "Ideal": [
        "<strong>Tradition.</strong> The ancient traditions of worship and sacrifice must be preserved and upheld. (Lawful)",
        "<strong>Charity.</strong> I always try to help those in need, no matter what the personal cost. (Good)",
        "<strong>Change.</strong> We must help bring about the changes the gods are constantly working in the world. (Chaotic)",
        "<strong>Power.</strong> I hope to one day rise to the top of my faith's religious hierarchy. (Lawful)",
        "<strong>Faith.</strong> I trust that my deity will guide my actions. I have faith that if I work hard, things will go well. (Lawful)",
        "<strong>Aspiration.</strong> I seek to prove myself worth of my god's favor by matching my actions against his or her teachings. (Any)"
      ],
      "Bond": [
        "I would die to recover an ancient relic of my faith that was lost long ago.",
        "I will someday get myh revenge on the corrupt tempe hierarchy who branded me a heretic.",
        "I owe my life to the priest who took me in when my parents died.",
        "Everything I do is for the common people.",
        "I will do anything to protect the temple where I served",
        "I seek to preserve a sacred text that my enemies consider heretical and seek to destroy"
      ],
      "Flaw": [
        "I judge others harshly, and myself even more severely.",
        "I put too much crust in those who wield power within my temple's hierarchy.",
        "My piety sometimes leads me to blindly trust those that profess faith in my god.",
        "I am inflexible in my thinking.",
        "I am suspicious of strangers and expect the worst of them.",
        "Once I pick a goal, I become obsessed with it to the detriment of everything else in my life."
      ]
    }
  },
  "Charlatan": {
    "Skill Proficiencies": ["Deception", "Sleight of Hand"],
    "Tool Proficiencies": ["Disguise Kit", "Forgery Kit"],
    "Equipment" : ["Set of fine clothes","Disguise Kit", "Tools of the con of your choice"],
    "Extra Features": {
      "False Identity": "False Identity",
      "Favorite Schemes": [
        "I cheat at games of chance.",
        "I shave coins or forge documents.",
        "I insinuate myself into people's lives to prey on their weakness and secure their fortunes.",
        "I put on new identities like clothes.",
        "I run sleight-of-hand cons on street corners.",
        "I convince people that worthless junk is worth their hard-earned money."
      ]
    },

    "Characteristics": {
      "Personality Trait": [
        "I fall in and out of love easily, and am always pursuing someone.",
        "I have a joke for every occasion, especially occasions where humor is inappropriate.",
        "Flattery is my preferred trick for getting what I want.",
        "I'm a born gambler who can't resist taking a risk for a potential payoff.",
        "I lie about almost everything, even where there's no good reason to.",
        "Sarcasm and insults are my weapons of choice.",
        "I keep multiple holy symbols on me and invoke whatever deity might come in useful at any given moment.",
        "I pocket anything I see that might have some value."
      ],
      "Ideal": [
        "<strong>Independance.</strong> I am a free spirit - no one tells me what to do. (Chaotic)",
        "<strong>Fairness.</strong> I never target people who can't afford to lose a few coins. (Lawful)",
        "<strong>Charity.</strong> I distribute the money I acquire to the people who really need it. (Good)",
        "<strong>Creativity.</strong> I never run the same con twice. (Chaotic)",
        "<strong>Friendship.</strong> Material goods come and go. Bonds of friendship last forever. (Good)",
        "<strong>Aspiration.</strong> I'm determined to make something of myself. (Any)"
      ],
      "Bond": [
        "I fleeced the wrong person and must work to ensure that this individual never crosses paths with me or those I care about.",
        "I owe everything to my mentore - a horrible person who's probably rotting in jail somewhere.",
        "Somewhere out there, I have a child who doesn't know me. I'm make the world better for him or her.",
        "I come from a noble family, and one day I'll reclaim my lands and title from those who stole them from me.",
        "A powerful person killed someone I love. SOme day soon, I'll have my revenge.",
        "I swindled and ruined a person who didn't deserve it. I seek to atone for my misdeeds but might never be able to forgive myself."
      ],
      "Flaw": [
        "I can't resist a pretty face",
        "I'm always in debt. I spend my ill-gotten gains on decadent luxuries faster than I bring them in.",
        "I'm convinced that no one could ever fool me the way I fool others.",
        "I'm too greedy for my own good. I can't resist taking a risk if there's money involved.",
        "I can't resist swindling people who are more powerful than me.",
        "I hate to admit it and will hate myself for it, but I'll run and preserve my own hide if the going gets tough."
      ]
    }
  }
}